In [2]:
a =1 ; b=2
print(a+b)

3

In [6]:
number='940310-2456456'
print(number[:6])

940310

In [13]:
a= '20010331Rainy'
date=a[:8]
weather=a[8:]
print('date=',date,'weather=', weather)

date= 20010331 weather= Rainy

In [15]:
a= 'pithon'
a[0]+'y'+a[2:]

'python'

In [19]:
a=[1,2,['a','b',['Life','is']]]
print(a[2][2][0])

Life

In [20]:
kor=80
eng=75
math=55
print((kor+eng+math)/3)

70.0

In [25]:
a=[1, 4, 7, 132]
for i in a:
    print('i=', i)
    if(i%2==0):
        print('짝수')    #### ('i={}는 짝수'.format(i))
    else:
        print('홀수')    #### ('i={}는 홀수'.format(i))

i= 1
홀수
i= 4
짝수
i= 7
홀수
i= 132
짝수

In [14]:
def my_func():
    print('my first fun!')
    print('my first fun!')

In [36]:
def my_friend(name):
    print('{}는 나의 친구'. format(name))
my_friend('홍길동')

홍길동는 나의 친구

In [8]:
def my_info(name, id, number):
    print('이름=', name)
    print('id=', id)
    print('number=', number)

In [29]:
my_info('길동', 123, '010-353')

이름= 길동
id= 123
number= 010-353

In [12]:
def my_clac(x,y):
    z = x*y
    return z

In [13]:
my_clac(3,5)

15

In [27]:
res = my_clac(4,10)
print(res)

40

In [34]:
def sum_many(*args):
    sum = 0
    for i in args:
        sum = sum + i
    return sum
sum_many(1,2,3)

6

In [37]:
sum_many(2,3,4)

9

In [39]:
from bs4 import BeautifulSoup

In [40]:
import selenium

In [41]:
dir(selenium)

['__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__']

In [42]:
print('version=', selenium.__version__)

version= 3.141.0

In [47]:
####### import
from pandas import Series, DataFrame          ##### pandas 안의 데이터프레임, 시리즈를 가져온다.
import pandas as pd
########## series
fruit=Series(data=[2500,3800,1200,6000],index = ['apple','banana','pear','cherry'])   ###data는 생략가능
print(fruit)          ########## 열 형태로, (index  value(data) )형태로

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64

In [46]:
import pandas as pd
fruit = pd.Series(data=[2500,3800,1200,6000])   #########none, 값을 줘도 안줘도 되는...

In [48]:
fruit = Series([2500,3800,1200,6000], index= ['apple','banana','pear','cherry'] )
print(fruit.index)
print(fruit.values)

Index(['apple', 'banana', 'pear', 'cherry'], dtype='object')
[2500 3800 1200 6000]

In [50]:
####Series()
fruitData = {'apple':2500, 'banana':3800, 'pear':1200, 'cherry':6000}
fruit = Series(fruitData)
type(fruitData)

dict

In [51]:
type(fruit)

pandas.core.series.Series

In [52]:
fruit = Series([2500,3800,1200,6000], index= ['apple','banana','pear','cherry'] )  ### data, index 순서바뀌어
fruit.name = 'fruitPrice'   #### index 칭하는 것,       ####도 앞에 data=, index= 를 써주면 알아서 정렬된다.
fruit.index.name = 'fruitName'
print(fruit)

fruitName
apple     2500
banana    3800
pear      1200
cherry    6000
Name: fruitPrice, dtype: int64

In [54]:
fruitData = {'fruitName':['apple','banana','cherry','peer'],
             'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]}

fruitFrame=DataFrame(fruitData)
print(fruitFrame)

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [59]:
fruitData = {'fruitName':['apple','banana','cherry','peer'],
             'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]}

fruitFrame = DataFrame(fruitData, columns=['fruitName','num','fruitPrice'])   ### 열 순서도 정할 수 있음.
print(fruitFrame)

  fruitName  num  fruitPrice
0     apple   10        2500
1    banana    5        3800
2    cherry    3        6000
3      peer    8        1200

In [60]:
fruitFrame['fruitName']        ###### Series Data만 추출 가능.

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [61]:
fruitFrame.fruitName           ###### 속성형식

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [62]:
####### 컬럼 추가하기 - 같은 값
fruitFrame['year'] = 2016
print(fruitFrame)

  fruitName  num  fruitPrice  year
0     apple   10        2500  2016
1    banana    5        3800  2016
2    cherry    3        6000  2016
3      peer    8        1200  2016

In [64]:
variable=Series(data=[4,2,1],index=[0,2,3]) 
fruitFrame['stock'] = variable
print(fruitFrame)

  fruitName  num  fruitPrice  year  stock
0     apple   10        2500  2016    4.0
1    banana    5        3800  2016    NaN
2    cherry    3        6000  2016    2.0
3      peer    8        1200  2016    1.0

In [68]:
######  row 삭제하기 drop() 이용

fruit = Series([2500,3800,1200,6000], index= ['apple','banana','pear','cherry'] )
new_fruit = fruit.drop('banana')
print(fruit) ;  print(new_fruit)

apple     2500
banana    3800
pear      1200
cherry    6000
dtype: int64
apple     2500
pear      1200
cherry    6000
dtype: int64

In [71]:
fruitData = {'fruitName':['apple','banana','cherry','peer'],
             'fruitPrice':[2500,3800,6000,1200],
             'num':[10,5,3,8]}

In [80]:
fruitName=fruitData['fruitName']
fruitName
###### index는 columns와 다르게 DataFrame을 만들고자 하는 데이터에서 가져올 수 없고 따로 객체가 존재해야 한다.

['apple', 'banana', 'cherry', 'peer']

In [77]:
fruitFrame=DataFrame(fruitData,index = fruitName, columns=['fruitPrice','num'])
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [79]:
fruitFrame2=fruitFrame.drop(['apple','cherry'])
fruitFrame2

        fruitPrice  num
banana        3800    5
peer          1200    8

In [87]:
fruitFrame3=fruitFrame.drop('num',axis=1) ## axis=1은 열 값, axis=0은 행 값

In [88]:
print(fruitFrame)  
print(fruitFrame3)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [90]:
fruitFrame  ### 원래 값을 가지고는 있다. 만약 위에서 drop('num',axis=1, ieplace=true)라 할 경우 원래값 없어짐

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [92]:
fruit = Series([2500,3800,1200,6000],index=['apple','banana','peer','cherry']) 
fruit['apple':'peer']

apple     2500
banana    3800
peer      1200
dtype: int64

In [101]:
fruitData = {'fruitName':['apple','banana','cherry','peer'], 
             'fruitPrice':[2500,3800,6000,1200], 
             'num':[10,5,3,8]} 
fruitName=fruitData['fruitName'] 
fruitFrame = DataFrame(fruitData,index = fruitName,columns=['fruitPrice','num'])

In [102]:
print(fruitFrame)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [95]:
fruitFrame['fruitPrice']

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

In [96]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

In [103]:
fruit1 = Series([5,9,10,3],index = ['apple','banana','cherry','peer']) 
fruit2 = Series([3,2,9,5,10],index = ['apple','orange','banana','cherry','mango']) 
print(fruit1) ; print(fruit2)

apple      5
banana     9
cherry    10
peer       3
dtype: int64
apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

In [104]:
fruit1 + fruit2

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [105]:
fruitData1 = {'Ohio' : [4,8,3,5],'Texas' : [0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1,columns=['Ohio','Texas'],index = ['apple','banana','cherry','peer'])

In [106]:
fruitData2 = {'Ohio' : [3,0,2,1,7],'Colorado':[5,4,3,6,0]} 
fruitFrame2 = DataFrame(fruitData2,columns =['Ohio','Colorado'],index = ['apple','orange','banana','cherry','mango'])

In [107]:
print(fruitFrame1); print(fruitFrame2)

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3
        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [108]:
fruitFrame1 + fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

In [118]:
fruit = Series(data=[2500,3800,1200,6000],index=['apple','banana','peer','cherry']) 
fruit.sort_values(ascending=False)   #### data 값을 내림차순으로 재정렬

cherry    6000
banana    3800
apple     2500
peer      1200
dtype: int64

In [123]:
fruitData = {'fruitName':['apple','banana','cherry','peer'], 
             'fruitPrice':[2500,3800,6000,1200], 
             'num':[10,5,3,8]} 
fruitName=fruitData['fruitName'] 
fruitFrame = DataFrame(fruitData,index = fruitName,columns=['num', 'fruitPrice'])

In [124]:
print(fruitFrame)

        num  fruitPrice
apple    10        2500
banana    5        3800
cherry    3        6000
peer      8        1200

In [125]:
fruitFrame.sort_index()   ##### index 정렬   a -> b -> c -> p

        num  fruitPrice
apple    10        2500
banana    5        3800
cherry    3        6000
peer      8        1200

In [126]:
fruitFrame.sort_index(axis=1)   #### 열에서 알파벳 순으로 정렬 f -> n

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [127]:
fruitFrame.sort_values(by=['fruitPrice'])    #### 값을 오름차순으로 정렬 1200-> 2500->***

        num  fruitPrice
peer      8        1200
apple    10        2500
banana    5        3800
cherry    3        6000

In [128]:
fruitFrame.sort_values(by=['num'])   #### 값을 num 오름차순으로 정렬  3-> 5-> ****

        num  fruitPrice
cherry    3        6000
banana    5        3800
peer      8        1200
apple    10        2500

In [129]:
fruitFrame.sort_values(by=['fruitPrice', 'num'])   
#### 기준을 여러칼럼으로 하고 싶을 때는 by 안의 리스트에 여러 개의 column 이름을 지정하면 된다.

        num  fruitPrice
peer      8        1200
apple    10        2500
banana    5        3800
cherry    3        6000

In [132]:
import pandas as pd
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv") 
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

In [133]:
german.columns

Index(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose', 'Credit Amount',
       'Value Savings/Stocks', 'Length of current employment',
       'Instalment per cent', 'Sex & Marital Status', 'Guarantors',
       'Duration in Current address', 'Most valuable available asset',
       'Age (years)', 'Concurrent Credits', 'Type of apartment',
       'No of Credits at this Bank', 'Occupation', 'No of dependents',
       'Telephone', 'Foreign Worker'],
      dtype='object')

In [135]:
german.columns.values

array(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose', 'Credit Amount',
       'Value Savings/Stocks', 'Length of current employment',
       'Instalment per cent', 'Sex & Marital Status', 'Guarantors',
       'Duration in Current address', 'Most valuable available asset',
       'Age (years)', 'Concurrent Credits', 'Type of apartment',
       'No of Credits at this Bank', 'Occupation', 'No of dependents',
       'Telephone', 'Foreign Worker'], dtype=object)

In [141]:
german.head()

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
0,1,1,18,4,2,1049,1,2,4,2,...,4,2,21,3,1,1,3,1,1,1
1,1,1,9,4,0,2799,1,3,2,3,...,2,1,36,3,1,2,3,2,1,1
2,1,2,12,2,9,841,2,4,2,2,...,4,1,23,3,1,1,2,1,1,1
3,1,1,12,4,0,2122,1,3,3,3,...,2,1,39,3,1,2,2,2,1,2
4,1,1,12,4,0,2171,1,3,4,3,...,4,2,38,1,2,2,2,1,1,2

In [143]:
german.shape

(1000, 21)

In [145]:
german.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Creditability                      1000 non-null   int64
 1   Account Balance                    1000 non-null   int64
 2   Duration of Credit (month)         1000 non-null   int64
 3   Payment Status of Previous Credit  1000 non-null   int64
 4   Purpose                            1000 non-null   int64
 5   Credit Amount                      1000 non-null   int64
 6   Value Savings/Stocks               1000 non-null   int64
 7   Length of current employment       1000 non-null   int64
 8   Instalment per cent                1000 non-null   int64
 9   Sex & Marital Status               1000 non-null   int64
 10  Guarantors                         1000 non-null   int64
 11  Duration in Current address        1000 non-null   int64
 12  Most valuable available asset      1000 non-null   int64
 13  Age (years)                        1000 non-null   int64
 14  Concurrent Credits                 1000 non-null   int64
 15  Type of apartment                  1000 non-null   int64
 16  No of Credits at this Bank         1000 non-null   int64
 17  Occupation                         1000 non-null   int64
 18  No of dependents                   1000 non-null   int64
 19  Telephone                          1000 non-null   int64
 20  Foreign Worker                     1000 non-null   int64
dtypes: int64(21)
memory usage: 164.2 KB

In [149]:
german_sample=german[['Creditability', 'Duration of Credit (month)', 'Purpose', 'Credit Amount']]
german_sample.min()          ########최솟값

Creditability                   0
Duration of Credit (month)      4
Purpose                         0
Credit Amount                 250
dtype: int64

In [150]:
german_sample.max()         ##########최댓값

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [151]:
german_sample.mean()         ######### 평균

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [152]:
german_sample.describe()      ####### 요약통계량

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000

In [153]:
german_sample=german[['Duration of Credit (month)','Credit Amount','Age (years)']]

In [154]:
german_sample.corr()       #### 상관관계

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [155]:
german_sample.cov()       ######## 공분산

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119

In [159]:
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv") 
list(german.columns.values)    ###### 있어도 되고, 없어도 됨.
german_sample=german[['Credit Amount', 'Type of apartment']]
german_grouped=german_sample['Credit Amount'].groupby(german_sample['Type of apartment'])

In [160]:
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

In [167]:
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv") 
german_sample=german[['Credit Amount','Purpose', 'Type of apartment']]
german_grouped2=german_sample['Credit Amount'].groupby([german_sample['Purpose'],german_sample['Type of apartment']])

In [168]:
german_grouped2.mean() # group을 두 가지 이상으로 지정하고 싶을 때,리스트를 통해 그룹을 두 개로 지정하면 된다

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64

In [3]:
import pandas as pd
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv") 
german_sample=german[['Type of apartment','Sex & Marital Status','Credit Amount']]
for type , group in german_sample.groupby('Type of apartment'):
    print(type)
    print(group.head(n=3))    ##### head(n=x) function은 데이터의 처음 n개의 값을 나타내 준다.

1
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
1                  1                     3           2799
2                  1                     2            841
2
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
3
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032

In [4]:
import pandas as pd
german=pd.read_csv("http://freakonometrics.free.fr/german_credit.csv")
german_sample=german[['Type of apartment','Sex & Marital Status']]
for (type,sex) , group in german_sample.groupby(['Type of apartment','Sex & Marital Status']):
    print((type,sex))
    print(group.head(n=3))   ##### head(n=x) function은 데이터의 처음 n개의 값을 나타내 준다.

(1, 1)
     Type of apartment  Sex & Marital Status
369                  1                     1
777                  1                     1
797                  1                     1
(1, 2)
   Type of apartment  Sex & Marital Status
0                  1                     2
2                  1                     2
9                  1                     2
(1, 3)
   Type of apartment  Sex & Marital Status
1                  1                     3
3                  1                     3
5                  1                     3
(1, 4)
    Type of apartment  Sex & Marital Status
11                  1                     4
14                  1                     4
17                  1                     4
(2, 1)
     Type of apartment  Sex & Marital Status
50                   2                     1
97                   2                     1
112                  2                     1
(2, 2)
    Type of apartment  Sex & Marital Status
8                   2                     2
12                  2                     2
33                  2                     2
(2, 3)
   Type of apartment  Sex & Marital Status
4                  2                     3
6                  2                     3
7                  2                     3
(2, 4)
    Type of apartment  Sex & Marital Status
48                  2                     4
57                  2                     4
78                  2                     4
(3, 1)
     Type of apartment  Sex & Marital Status
620                  3                     1
749                  3                     1
784                  3                     1
(3, 2)
     Type of apartment  Sex & Marital Status
423                  3                     2
453                  3                     2
467                  3                     2
(3, 3)
    Type of apartment  Sex & Marital Status
29                  3                     3
44                  3                     3
69                  3                     3
(3, 4)
     Type of apartment  Sex & Marital Status
125                  3                     4